Revit 2027 API
FormatOptions.CanUsePlusPrefix Method
 Checks whether a plus prefix can be displayed for the display unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanUsePlusPrefix()
Public Function CanUsePlusPrefix As Boolean
public:
bool CanUsePlusPrefix()
member CanUsePlusPrefix : unit -> bool
Return Value
Boolean
 True if a plus prefix can be displayed, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
Reference
FormatOptions Class
CanUsePlusPrefix Overload
Autodesk.Revit.DB Namespace